import data from "../data/quiz.json" assert { type: "json" };
let nowQuestion = 0;
let score = 0;

// รับ event จากปุ่ม start quiz เพื่อให้เริ่มแสดงคำถามภายใน div.question

// ภายใน div.question ให้ทำการแสดงคำถาม H3 ตัวเลือกทั้งหมดทีละข้อ h6
// ภายในตัวเลือกแต่ละข้อ ให้สร้างปุ่มเพื่อกำหนดอีเว้นของตัวเลือก spoiller:: assign value of button
// เมื่อผู้ใช้เลือกคำตอบ ให้แสดง stat ของการเลือกว่าถูกหรือผิด จากนั้นให้แสดงคำถามและตัวเลือกของข้อให้

// สำหรับ stat ของคำตอบนั้น เมื่อผู้ใช้งานกดปุ่มหน้าตัวเลือกให้ทำการเช็คเงื่อนไขว่า ปุ่มนั้นตรงกับคำตอบที่ถูกต้องหรือไม่
// หากถูกต้อง ให้ทำการสร้าง span ใน div.score แสดงเลขข้อ และสถานะ และตั้ง bgcolor เป็นสี yellowgreen หากผิดให้แสดงเป้นสี red

// เมื่อตอบคำถามครบทุกข้อแล้วให้แสดงผลลัพธ์ของ total score ออกแบบเองได้เลยยยย

function start() {
  // รีเซ็ตการทำงานในส่วนที่แสดง score ทั้งหมด
  nowQuestion = 0;
  score = 0;
  question(); // แสดงคำถาม และรายการของตัวเลือกในแต่ละข้อ
  // รีเซ็ตการทำงานในส่วนที่แสดง score ทั้งหมด
}
function question() {
  let now = data[nowQuestion++];
  // แสดงคำถาม และรายการของตัวเลือกในแต่ละข้อ
  // ในส่วนของปุ่มในเรียกใช้
  // function checkANS(ข้อมูลของ button)

  function checkANS(event) {
     if (เช็คคำถามว่าถูกต้องเป็นจริง) {

    //สร้าง span เพื่ออัพเดต stat กรณีเลือกคำตอบที่ถูก
    score++;
    nowQuestion++;
    question();
    } else {
    //สร้าง span เพื่ออัพเดต stat กรณีเลือกคำตอบที่ผิด
    nowQuestion++;
    question();
     }
  }
}

// เรียก start button เพื่อดำเนินการดังนี้ ------
// เปลี่ยนข้อความของปุ่มเป็น re quiz
// เรียกใช้ start() // ทำการรีเซ็ตกลับเป็นค่าเริ่มต้นทั้งหมด
